Revit 2027 API
Application.IsMassingEnabled Property
 Checks whether or not the massing and site tools are enabled, and enable or disable them.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsMassingEnabled { get; set; }
Public Property IsMassingEnabled As Boolean
	Get
	Set
public:
property bool IsMassingEnabled {
	bool get ();
	void set (bool value);
}
member IsMassingEnabled : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace